/* Файл `terraform.tfvars` містить конкретні значення змінних, які використовуються в інших Terraform файлах для налаштування інфраструктури. Тут ми визначаємо регіон AWS, ідентифікатори VPC та підмереж, а також теги для ресурсів. Ці значення дозволяють Terraform створювати ресурси в правильному місці з потрібними параметрами. */

/* Загальний регіон для всієї інфраструктури. Вказуємо, де будуть створюватися ресурси AWS. */
region = "eu-central-1"

# General for all infrastructure
# This is the name prefix for all infra components
name = "sk"

/* Ідентифікатор VPC, в якому буде розгортатися EKS кластер. Це дозволяє Terraform знати, де саме створювати ресурси, пов’язані з мережею. */
vpc_id      = "vpc-0e9ce6f45b6762d99"
subnets_ids = ["subnet-067b46c896bbe7898", "subnet-043632b1e25028b4b", "subnet-08759cdae19a0a977"]

/* Теги для ресурсів, які допомагають у організації та управлінні ресурсами в AWS. Теги можуть використовуватися для фільтрації ресурсів, управління витратами та інших цілей. */
tags = {
  Environment = "dev"
  TfControl   = "true"
  Owner       = "svitlana.kizilpinar@gmail.com"
}

/* Ім’я зони Route 53, яка буде використовуватися для валідації ACM сертифіката. Це дозволяє Terraform знайти правильну зону для створення DNS записів, необхідних для підтвердження володіння доменом. */
zone_name = "devops10.test-danit.com"
